{
    "version": "https://jsonfeed.org/version/1",
    "title": "data bar | the coldpress blog",
    "description": "",
    "home_page_url": "https://blog.coldpress.ai",
    "feed_url": "https://blog.coldpress.ai/feed.json",
    "user_comment": "",
    "icon": "https://blog.coldpress.ai/media/website/Untitled-1000-x-500-px-1500-x-300-px2.png",
    "author": {
        "name": "Abhishek Choudhary"
    },
    "items": [
        {
            "id": "https://blog.coldpress.ai/reverse-engineering-excellence-working-backwards-from-impressive-ml-results.html",
            "url": "https://blog.coldpress.ai/reverse-engineering-excellence-working-backwards-from-impressive-ml-results.html",
            "title": "Reverse-engineering excellence: working backwards from impressive ML results",
            "summary": "In a world where striking the right balance between accuracy, efficiency, and robustness is becoming the CAP theorem of AI,&hellip;",
            "content_html": "<div class=\"w-full border-b border-black/10 dark:border-gray-900/50 text-gray-800 dark:text-gray-100 group dark:bg-gray-800\">\n<div class=\"text-base gap-4 md:gap-6 m-auto md:max-w-2xl lg:max-w-2xl xl:max-w-3xl p-4 md:py-6 flex lg:px-0\">\n<div class=\"relative flex w-[calc(100%-50px)] flex-col gap-1 md:gap-3 lg:w-[calc(100%-115px)]\">\n<div class=\"flex justify-between\">\n<p><span data-preserver-spaces=\"true\">In a world where striking the right balance between accuracy, efficiency, and robustness is becoming the CAP theorem of AI, good outcomes still follow good decisions and garbage-in-garbage-out is as true as ever.</span></p>\n<p><span data-preserver-spaces=\"true\">Imagine for a moment that you've successfully completed your computer vision project, and your model's performance is just...well, impressive. We've established that that's already happened, now let's see how that came to be.</span></p>\n<p><span data-preserver-spaces=\"true\">In short, a combination of data quality, processing strategies, model selection, and validation rigour. But those are just words! So are the ones that follow, but more of them.</span></p>\n<h2><span data-preserver-spaces=\"true\">Data quality matters</span></h2>\n<p><span data-preserver-spaces=\"true\">In the least-hot-but-still-crucial take in computer vision in 2023, data quality matters. Everyone and their grandma know this, and a good society should aspire to listen to these well-educated grandmas, if nothing else.</span></p>\n<p><span data-preserver-spaces=\"true\">So, what makes a dataset high-quality? For CV projects, key characteristics to consider include size, quality, cleanliness, representativeness, and balance.</span></p>\n<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td class=\"align-center\" style=\"width: 22.6819%;\"><strong>Characteristic </strong></td>\n<td class=\"align-center\" style=\"width: 24.6849%;\"><strong>What it means</strong></td>\n<td class=\"align-center\" style=\"width: 52.6332%;\"><strong>How it helps</strong></td>\n</tr>\n<tr>\n<td style=\"width: 22.6819%;\">Size</td>\n<td style=\"width: 24.6849%;\">The number of samples/examples in the dataset</td>\n<td style=\"width: 52.6332%;\">Larger datasets provide more examples for the model to learn from, increasing generalization and reducing overfitting.</td>\n</tr>\n<tr>\n<td style=\"width: 22.6819%;\">Quality</td>\n<td style=\"width: 24.6849%;\">Resolution, sharpness, and clarity of images</td>\n<td style=\"width: 52.6332%;\">High-quality images allow the model to capture and learn finer details, leading to better task performance in identifying small features.</td>\n</tr>\n<tr>\n<td style=\"width: 22.6819%;\">Cleanliness</td>\n<td style=\"width: 24.6849%;\">Absence of duplicate, irrelevant, or corrupted samples</td>\n<td style=\"width: 52.6332%;\">A clean dataset ensures that the model learns from relevant and unique examples, improving overall performance and reducing noise.</td>\n</tr>\n<tr>\n<td style=\"width: 22.6819%;\">Representation</td>\n<td style=\"width: 24.6849%;\">Diversity of samples across different scenarios</td>\n<td style=\"width: 52.6332%;\">A representative dataset ensures that the model is exposed to a wide range of variations and situations, leading to better robustness to unseen data.</td>\n</tr>\n<tr>\n<td style=\"width: 22.6819%;\">Balance</td>\n<td style=\"width: 24.6849%;\">Equal representation of all classes</td>\n<td style=\"width: 52.6332%;\">Balanced datasets prevent the model from being biased towards certain classes, ensuring fair and accurate performance across all classes.</td>\n</tr>\n</tbody>\n</table>\n</div>\n</div>\n</div>\n</div>\n<div class=\"w-full border-b border-black/10 dark:border-gray-900/50 text-gray-800 dark:text-gray-100 group bg-gray-50 dark:bg-[#444654]\">\n<div class=\"text-base gap-4 md:gap-6 m-auto md:max-w-2xl lg:max-w-2xl xl:max-w-3xl p-4 md:py-6 flex lg:px-0\">\n<p><span data-preserver-spaces=\"true\">But wait, there's more! An often-underestimated aspect of datasets is the accuracy of labelling and annotation. Picture this: you're training your model using a dataset in which an adorable puppy is mislabeled as a fearsome grizzly bear. As endearing as that mental image might be, it spells disaster for your model's ability to correctly identify and categorize images.</span></p>\n<p><a target=\"_blank\" href=\"https://coldpress.ai/premium?ref=blog-reverse-engineering-excellence\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">Pssst, hey you, yes you. Coldpress AI can help you find large, high-res, clean, representative, balanced, and well-annotated for computer vision.</span></a></p>\n<h2><span data-preserver-spaces=\"true\">Good data processed well can be good data multiplied</span></h2>\n<p><span data-preserver-spaces=\"true\">Once you have your hands on a good dataset, you might think the job is half done. And it is, so hurray! But a lot remains - specifically, data processing.</span></p>\n<p><span data-preserver-spaces=\"true\">Your journey takes you everywhere from basics like image size standardization to intermediate necessities like denoising, equalization, and normalization. You can even take the optional steps to do grey-scale conversion to speed up learning while preserving most of the learning potential of a dataset (for most use cases but not all).</span></p>\n<p><span data-preserver-spaces=\"true\">Feature extraction during this phase can also help you get better results later, in conjunction with manual annotation. Tasks like edge detection, </span><a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Scale-invariant_feature_transform\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">SIFT</span></a><span data-preserver-spaces=\"true\"> (Scale-Invariant Feature Transform) / </span><a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Speeded_up_robust_features\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">SURF</span></a><span data-preserver-spaces=\"true\"> (Speeded-Up Robust Features) and </span><a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Histogram_of_oriented_gradients\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">HOG</span></a><span data-preserver-spaces=\"true\"> (Histogram of Oriented Gradients) can help you make your dataset a more informative and compact representation of what it's supposed to represent.</span></p>\n<p><span data-preserver-spaces=\"true\">And finally, data augmentation. The often-ignored but amazingly valuable way to increase the size and diversity of the dataset - if done correctly. By applying various transformations such as rotation, flipping, scaling, or adding noise, you can create new training examples that help the model generalize better. Imagine a dataset of cats lounging in various positions. Augmenting this data with flipped, rotated, or zoomed-in versions of these images helps our model grasp the feline essence.</span></p>\n<p><a target=\"_blank\" href=\"https://coldpress.ai/generate?ref=blog-reverse-engineering-excellence\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">Oh, by the way, did you know that you can find tools on Coldpress AI to augment your datasets? Yeah! Our interpolate APIs can help you do just that</span></a><span data-preserver-spaces=\"true\">. Wow, what a coincidence that that came up so organically!</span></p>\n<h2><span data-preserver-spaces=\"true\">No model, no performance</span></h2>\n<p><span data-preserver-spaces=\"true\">Models are no longer crucial differentiators for most projects and use-cases - they're well on their way to being commoditized for most requirements. However, the fact that you can't go too wrong doesn't mean you don't have work to do.</span></p>\n<p><a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Convolutional_neural_network\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">CNNs</span></a><span data-preserver-spaces=\"true\"> (Convolutional Neural Networks) are the classical choice for image-related AI tasks, but </span><a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Vision_transformer\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">Vision Transformers</span></a><span data-preserver-spaces=\"true\"> are on the rise in popularity. You can find pre-trained models all over the internet, including on Huggingface and Kaggle. As we said, hard to go too wrong, if you bring the right dataset, processing, parameter tuning, and attitude to the table!</span></p>\n<p><span data-preserver-spaces=\"true\">Speaking of parameter tuning, let's talk hyperparameter tuning. You can take a pick of strategies individually, or a combination thereof - Grid Search, Random Search, and Bayesian Optimization (and many others). The idea is to find a configuration that maximizes your model's performance - but don't let hyperparameter tuning turn into hyperparameter over-optimization. In fact, you can strategically avoid over-optimization by doing some regularization. L1 and L2 regularizations add a penalty to the model's loss function, and help discourage overly complex model development. Dropout is another popular regularization technique for neural networks, where a random subset of neurons is \"dropped out\" during training, forcing the model to rely on feature diversity.</span></p>\n<h2><span data-preserver-spaces=\"true\">Evaluate, Validate, Wait</span></h2>\n<p><span data-preserver-spaces=\"true\">Can't be impressive unless you test, right? You can test using the classic Train-Validation-Test split. Segment your dataset into three distinct subsets: training, validation, and testing. The \"training\" set is used to learn the model's parameters, the \"validation\" set helps with hyperparameter tuning and model selection, and the \"testing\" set serves as the final evaluation to gauge the model's performance on unseen data. Or, you could go fancier and use something like </span><a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Cross-validation_(statistics)\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">K-fold Cross-validation</span></a><span data-preserver-spaces=\"true\"> - where you cut the dataset into k equally-sized folds, the model is trained k times (each time using k-1 folds for training and the remaining fold for validation) and the average performance across all runs serves as the overall performance metric.</span></p>\n<p><span data-preserver-spaces=\"true\">This is also the step where you should be looking to zero down on your performance metric of choice. Maybe some of our old writing can help here - </span><a target=\"_blank\" href=\"https://blog.coldpress.ai/a-very-serious-guide-for-decoding-model-accuracy-precision-recall-and-f1.html?ref=blog-reverse-engineering-excellence\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">we recently did an explainer for some standard ways to measure the performance of your model</span></a><span data-preserver-spaces=\"true\">.</span></p>\n<h2><span data-preserver-spaces=\"true\">Conclusion</span></h2>\n<p><span data-preserver-spaces=\"true\">Well, there you have it folks - if you have a successful computer vision model today, then these are some things you probably did to get here. Is there something we missed? Let us know we're always looking to learn here at Coldpress!</span></p>\n<p><span data-preserver-spaces=\"true\">And of course, we can help you do a bunch of these things to help your performance constantly improve - from </span><a target=\"_blank\" href=\"https://coldpress.ai/generate?ref=blog-reverse-engineering-excellence\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">data augmentation tools</span></a><span data-preserver-spaces=\"true\"> to </span><a target=\"_blank\" href=\"https://coldpress.ai/premium?ref=blog-reverse-engineering-excellence\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">ready-to-go datasets</span></a><span data-preserver-spaces=\"true\"> and </span><a target=\"_blank\" href=\"https://coldpress.ai/butler?ref=blog-reverse-engineering-excellence\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">model consultation and much more</span></a><span data-preserver-spaces=\"true\">.</span></p>\n<p><a target=\"_blank\" href=\"https://coldpress.ai/login?ref=blog-reverse-engineering-excellence\" class=\"editor-rtfLink\" rel=\"noopener\"><span data-preserver-spaces=\"true\">Sign up today</span></a><span data-preserver-spaces=\"true\">! Or tomorrow, no pressure.</span></p>\n</div>\n</div>",
            "image": "https://blog.coldpress.ai/media/posts/3/blog3-final1.png",
            "author": {
                "name": "Abhishek Choudhary"
            },
            "tags": [
                   "premium-datasets",
                   "model-testing",
                   "model-selection",
                   "model-performance",
                   "ml-basics",
                   "metrics-and-measurement",
                   "machine-learning",
                   "data-quality",
                   "data-processing",
                   "data-imbalance",
                   "data-engineering",
                   "data-augmentation",
                   "computer-vision",
                   "coldpress-ai",
                   "artificial-intelligence"
            ],
            "date_published": "2023-04-18T07:25:00-04:00",
            "date_modified": "2023-04-19T00:21:59-04:00"
        },
        {
            "id": "https://blog.coldpress.ai/a-very-serious-guide-for-decoding-model-accuracy-precision-recall-and-f1.html",
            "url": "https://blog.coldpress.ai/a-very-serious-guide-for-decoding-model-accuracy-precision-recall-and-f1.html",
            "title": "A very serious guide for decoding model accuracy, precision, recall, and F1",
            "summary": "Okay I lied, this is only a mildly serious guide. With that disclosure out of the way and our conscience&hellip;",
            "content_html": "<div class=\"flex flex-grow flex-col gap-3\">\n<div class=\"min-h-[20px] flex flex-col items-start gap-4 whitespace-pre-wrap\">\n<div class=\"markdown prose w-full break-words dark:prose-invert light\">\n<p class=\"dropcap\">Okay I lied, this is only a mildly serious guide. With that disclosure out of the way and our conscience being clear, let's dive into the age-old question for the umpteenth time: accuracy, precision, recall, or F1? Which one should you choose to track the performance of your AI model? The answer is, frustratingly and always, that it depends. But don't worry, we're here to guide you through the jungle of metrics and help you make the right choice.</p>\n<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 16.5478%;\"><strong>Metric</strong></td>\n<td style=\"width: 41.2242%;\"><strong>What it is</strong></td>\n<td style=\"width: 42.228%;\"><strong>What it measures</strong></td>\n</tr>\n<tr>\n<td style=\"width: 16.5478%;\"><strong>Accuracy</strong></td>\n<td style=\"width: 41.2242%;\">Number of correct predictions divided by total number of predictions</td>\n<td style=\"width: 42.228%;\">How often the model is correct</td>\n</tr>\n<tr>\n<td style=\"width: 16.5478%;\"><strong>Precision</strong></td>\n<td style=\"width: 41.2242%;\">Number of true positive predictions divided by the sum of true positive and false positive predictions</td>\n<td style=\"width: 42.228%;\">Proportion of positive predictions that are actually correct</td>\n</tr>\n<tr>\n<td style=\"width: 16.5478%;\"><strong>Recall</strong></td>\n<td style=\"width: 41.2242%;\">Number of true positive predictions divided by the sum of true positive and false negative predictions</td>\n<td style=\"width: 42.228%;\">Proportion of actual positive cases that were correctly predicted</td>\n</tr>\n<tr>\n<td style=\"width: 16.5478%;\"><strong>F1</strong></td>\n<td style=\"width: 41.2242%;\">Harmonic mean of precision and recall</td>\n<td style=\"width: 42.228%;\">Composite metric, it is a balance of precision and recall</td>\n</tr>\n</tbody>\n</table>\n<p>Now, why is picking your north star metric not a simple and obvious choice? Why must the diplomatic \"it depends\" raise its head again here? As with most things, the pesky issue is the abstract best that is market dynamics. Let's see:</p>\n<p>Sometimes, accuracy is a great metric to use. For example, if you're building a model to predict whether it's going to rain tomorrow, accuracy is probably the way to go. If the model predicts rain and it doesn't rain, or if it predicts no rain and it does rain, the consequences are not severe. However, if you're building a model to predict whether a patient has a certain disease, the consequences of false positive or false negative predictions can be much more severe. In this case, you want to use precision, recall, or F1 to ensure that your model is not only correct, but also not making false positive or false negative predictions.</p>\n<p>Ooh, ooh, look, another intricacy is rearing its head. It's amazing to see it in the wild. Nature, man. This one called \"imbalanced datasets\". If your dataset is imbalanced, accuracy can be a misleading metric. For example, if you have a dataset of 99% negative cases and 1% positive cases, a model that always predicts negative will have an accuracy of 99%. But clearly, this is not a useful model. In these cases, precision, recall, or F1 may be a better choice. That said, the smart choice in case you find yourself wrangling with a dataset clearly imbalanced to that degree, you're better served throwing it in a trash can and <a href=\"https://coldpress.ai/premium?ref=blog-a-very-serious-guide-for-decoding-model-accuracy-precision-recall-and-f1\" target=\"_blank\" rel=\"noopener\">hitting us up at Coldpress AI to find something better</a>.</p>\n<p>So, what's the verdict? Well, it's like I said at the beginning: it depends. But, in general, if you're building a model for a low-stakes application, accuracy is probably fine. If you're building a model for a high-stakes application, you may want to use precision, recall, or F1. And if your dataset is imbalanced, be cautious about relying on anything.</p>\n<p>One more interesting thing is the issue of stratification in F1, down to the fact that models typically solve multiple use cases which can have differeing levels of business importance, so something that has a 0.95 f-score can still wildly vary between use cases in terms of end-user satisfaction. This stratification is a topic of intense research that we're both doing and keeping tabs on. <a href=\"https://coldpress.ai/horizon?ref=blog-a-very-serious-guide-for-decoding-model-accuracy-precision-recall-and-f1\" target=\"_blank\" rel=\"noopener\">Sign up here to stay in the loop</a>!</p>\n</div>\n</div>\n</div>",
            "image": "https://blog.coldpress.ai/media/posts/2/blog2-final1.png",
            "author": {
                "name": "Abhishek Choudhary"
            },
            "tags": [
                   "model-recall",
                   "model-precision",
                   "model-performance",
                   "model-f1",
                   "model-accuracy",
                   "metrics-and-measurement",
                   "machine-learning",
                   "f-score",
                   "data-imbalance",
                   "data-engineering",
                   "coldpress-ai",
                   "artificial-intelligence"
            ],
            "date_published": "2023-03-07T07:08:00-05:00",
            "date_modified": "2023-03-07T10:49:49-05:00"
        },
        {
            "id": "https://blog.coldpress.ai/hello-world-introducing-coldpress-ai.html",
            "url": "https://blog.coldpress.ai/hello-world-introducing-coldpress-ai.html",
            "title": "Hello world - introducing Coldpress AI!",
            "summary": "Friends, Data Scientists, countrymen (and countrywomen), lend me your ears. I come to introduce you to Coldpress AI - a&hellip;",
            "content_html": "<div class=\"flex flex-grow flex-col gap-3\">\n<div class=\"min-h-[20px] flex flex-col items-start gap-4 whitespace-pre-wrap\">\n<div class=\"markdown prose w-full break-words dark:prose-invert light\">\n<p class=\"dropcap\">Friends, Data Scientists, countrymen (and countrywomen), lend me your ears. I come to introduce you to Coldpress AI - a Machine Learning supermarket. We started this venture to ease the pain of AI development experience, believing that AI can be as fun to develop as it is to use.</p>\n<p>Let me take you through our establishment. On your left, you'll see the first aisle - our open dataset platform. We're building the largest catalog of open datasets in the world, so that it's not a wild goosechase when you want to experiment with a new idea and you spend weeks and months looking for what's available in the fantastic but fragmented frontiers of the open source community. <a href=\"https://coldpress.ai/explore?ref=blog-hello-world-introducing-coldpress-ai\" target=\"_blank\" rel=\"noopener\">Check it out here</a> - it's a work in progress, and it will only get better with time!</p>\n<p>If you look to your right, you'll find our crown jewel - premium datasets from the foremost producers in the market. The relationship between model accuracy and data quality is well known to the point of being canonical, and yet premium datasets are some of the least \"discoverable\" parts of AI development. No more - with Coldpress datasets, you get an easily navigable catalog of datasets relevant to you, available instantly with your resolution and refresh rates of choice. And in the interest of making your experience superlative, we have an extra goodie for you - your own data assistant. If you don't find what you're looking for, you simply tell us and we do the search and negotiation for you, and make it available to you through the reliable consistency our our API. Once you start getting your data from Coldpress, you will never need anything else. If this is your cup of your-beverage-of-choice, you can <a href=\"https://coldpress.ai/premium?ref=blog-hello-world-introducing-coldpress-ai\">find it here</a>.</p>\n<p>The next section is our super-secret R&amp;D lab, developing super-secret ways to produce synthetic data. You can interpolate your existing dataset, extrapolate from a few samples, and soon, even make something from nothing. One day, we think data production can be as simple as making an image on Midjourney or a blog post on ChatGPT. It's not there today, but we're making progress. Our first foray is our data augmentation API - the first rung of data engineering. To get started, you'll find features like flipping images horizontally, vertically, or both; rotating images; adjusting the brightness or contrast; and even adding random noise. The idea is that these transformed images will provide additional examples for the algorithm to learn from, training it on a much larger and more diverse dataset than you ever could before. You can <a href=\"https://coldpress.ai/generate?ref=blog-hello-world-introducing-coldpress-ai\" target=\"_blank\" rel=\"noopener noreferrer\">request access for it right now</a>.</p>\n<p>The last section is our even-more-secret R&amp;D lab, developing even-more-secret ways to make your life better. We keep an ear to the ground, and an eye to the horizon, looking out not just for your data needs today, but thinking about your data needs tomorrow. We collaborate with the brightest minds in academia, becoming the bridge through which today's research can help shape tomorrow's reality. We're currently focussing on building adverserial training datasets for common use-cases. Our upcoming projects include helping businesses tie the relation between measure model performance and business performance more reliably. You can <a href=\"https://coldpress.ai/horizon?ref=blog-hello-world-introducing-coldpress-ai\" target=\"_blank\" rel=\"noopener\">sign up for updates</a> here to stay tuned (or even better, let us know what you'd like to see on our roadmap)  - this will be an interesting ride!</p>\n<p>In short, we believe this is the end of your need to repeatedly scour the internet for datasets. No more worrying about the quality of what you've found, and no more pulling your hair out trying to augment it. Coldpress AI has got you covered. Imagine all the time and energy you'll save by not having to do any of those things - you might be able to add a siesta to your daily routine.<em> <span class=\"ILfuVd\" lang=\"en\"><span class=\"hgKElc\">¡</span></span>Que bien!</em></p>\n<p>Now you might be looking at all of this and be asking yourself, \"when exactly will I use all this?\" And I'm glad you asked, because I'm happy to say that we have very clearly defined our use cases. Imagine this: bad guys have broken into your home and are holding your beloved pet housefly hostage. Their ask for ransom? 10 GBs of photos of spiders in low lighting conditions. Until yesterday, this would've landed you in quite a pickle. But today, you can just come to Coldpress AI, and we will help you out. And maybe you can tell the bad guys about us, so they don't have to resort to nefarious acts to fulfil their data needs.</p>\n<p>So there you have it, folks. Coldpress AI, the future of data. Don't wait, <a href=\"https://coldpress.ai/login/?ref=blog-hello-world-introducing-coldpress-ai\" target=\"_blank\" rel=\"noopener\">sign up today</a> and see for yourself!</p>\n</div>\n</div>\n</div>",
            "image": "https://blog.coldpress.ai/media/posts/1/blog1-final1.png",
            "author": {
                "name": "Abhishek Choudhary"
            },
            "tags": [
                   "synthetic-data",
                   "premium-datasets",
                   "open-datasets",
                   "machine-learning",
                   "data-engineering",
                   "data-augmentation",
                   "computer-vision",
                   "coldpress-ai",
                   "announcements"
            ],
            "date_published": "2023-02-11T22:28:00-05:00",
            "date_modified": "2023-03-07T10:49:14-05:00"
        }
    ]
}
